-- MOVIE TABLE 데이터 INSERT
SELECT * FROM MOVIE;
DESC MOVIE;

INSERT INTO MOVIE VALUES (1, '스파이더맨 - 노 웨이 홈', '존 왓츠', '톰 홀랜드, 젠데이아 콜먼, 베네딕트 컴버배치', 
    '액션, 어드벤쳐, SF', '2021/12/15', 12, 
    '영화 <스파이더맨: 노 웨이 홈>은 정체가 탄로난 스파이더맨 "피터 파커"(톰 홀랜드)가 문제를 해결하기 위해 "닥터 스트레인지"(베네딕트 컴버배치)의 도움을 받던 중 뜻하지 않게 멀티버스가 열리게 되고, 이를 통해 "닥터 옥토퍼스"(알프리드 몰리나) 등 각기 다른 차원의 숙적들이 나타나며 사상 최악의 위기를 맞게 되는 이야기를 그린 마블 액션 블록버스터.',
    2, 148, 0
    );
    
INSERT INTO MOVIE VALUES (2, '베놈2 - 렛 데어 비 카니지', '앤디 서키스', '톰 하디, 미셀 윌리엄스, 나오미 해리스',
    '액션, 스릴러, SF', '2021/10/13', 15,
    '히어로의 시대는 끝났다. ‘베놈’과완벽한 파트너가 된 ‘에디 브록’(톰하디) 앞에 ‘클리터스 캐서디’(우디 해럴슨)가 ‘카니지’로 등장, 앞으로 닥칠 대혼돈의 세상을 예고한다. 대혼돈의 시대가 시작되고, 악을 악으로 처단할 것인가 ',
    2, 97, 0
    );

INSERT INTO MOVIE VALUES(3, '싱크홀', '김지훈', '차승원, 김성균, 이광수',
    '드라마', '2021/08/11', 12,
    '사.상.초.유! 도심 속 초대형 재난 발생! 서울 입성과 함께 내 집 마련의 꿈을 이룬 가장 ‘동원(김성균)’ 이사 첫날부터 프로 참견러 ‘만수’(차승원)와 사사건건 부딪힌다. ‘동원’은 자가취득을 기념하며 직장 동료들을 집들이에 초대하지만 행복한 단꿈도 잠시, 순식간에 빌라 전체가 땅 속으로 떨어지고 만다.  마주치기만 하면 투닥거리는 빌라 주민 ‘만수’와 ‘동원’, ‘동원’의 집들이에 왔던 ‘김대리’(이광수)와 인턴사원 ‘은주’(김혜준)까지! 지하 500m 싱크홀 속으로 떨어진 이들은 과연 무사히 빠져나갈 수 있을까? “한 500m 정도는 떨어진 것 같아” “우리… 나갈 수 있을까요?” ',
    1, 114, 0
    );

INSERT INTO MOVIE VALUES (4, '마녀 Part 2. The Other One', '박훈정', '김다미, 이종석, 신시아',
    '액션', '2022/06/15', 15,
    '"통제불능의 존재가 세상 밖으로 나왔다!
    ’자윤’이 사라진 뒤, 정체불명의 집단의 무차별 습격으로 마녀 프로젝트가 진행되고 있는 ‘아크’가 초토화된다. 그곳에서 홀로 살아남은 ‘소녀’는 생애 처음 세상 밖으로 발을 내딛고 우연히 만난 ‘경희’의 도움으로 농장에서 지내며 따뜻한 일상에 적응해간다. 한편, ‘소녀’가 망실되자 행방을 쫓는 책임자 ‘장’과 마녀 프로젝트의 창시자 ‘백총괄’의 지령을 받고 제거에 나선 본사 요원 ‘조현’, ‘경희’의 농장 소유권을 노리는 조직의 보스 ‘용두’와 상해에서 온 의문의 4인방까지 각기 다른 목적을 지닌 세력이 하나 둘 모여들기 시작하면서 ‘소녀’ 안에 숨겨진 본성이 깨어나는데… 모든 것의 시작, 더욱 거대하고 강력해진 마녀가 온다."',
    1, 137, 1
    );

INSERT INTO MOVIE VALUES (5, '브로커', '고레에다 히로카즈', '송강호, 강동원, 배두나, 이지은',
    '드라마', '2022/06/08', 12,
    '세탁소를 운영하지만 늘 빚에 시달리는 ‘상현’(송강호)과 베이비 박스 시설에서 일하는 보육원 출신의 ‘동수’(강동원).?거센 비가 내리는 어느 날 밤, 그들은 베이비 박스에 놓인 한 아기를 몰래 데려간다. 하지만 이튿날, 생각지 못하게 엄마 ‘소영’(이지은)이 아기 ‘우성’을 찾으러 돌아온다. 아기가 사라진 것을 안 소영이 경찰에 신고하려 하자 솔직하게 털어놓는 두 사람. 우성이를 잘 키울 적임자를 찾아 주기 위해서 그랬다는 변명이 기가 막히지만 소영은 우성이의 새 부모를 찾는 여정에 상현, 동수와 함께하기로 한다. 한편 이 모든 과정을 지켜본 형사 ‘수진’(배두나)과 후배 ‘이형사’(이주영). 이들을 현행범으로 잡고 반 년째 이어온 수사를 마무리하기 위해 조용히 뒤를 쫓는다. ?베이비 박스, 그곳에서 의도치 않게 만난 이들의 예기치 못한 특별한 여정이 시작된다.',
    1, 129, 1
    );
    
INSERT INTO MOVIE VALUES (6, '범죄도시2', '이상용', '마동석, 손석구, 최귀화',
    '액션', '2022/05/18', 15,
    '느낌 오지 ? 이놈 잡아야 하는 거” 가리봉동 소탕작전 후 4년 뒤, 금천서 강력반은 베트남으로 도주한 용의자를 인도받아 오라는 미션을 받는다. 괴물형사 ‘마석도’(마동석)와 ‘전일만’(최귀화) 반장은 현지 용의자에게서 수상함을 느끼고, 그의 뒤에 무자비한 악행을 벌이는 ‘강해상’(손석구)이 있음을 알게 된다. ‘마석도’와 금천서 강력반은 한국과 베트남을 오가며 역대급 범죄를 저지르는 ‘강해상’을 본격적으로 쫓기 시작하는데...나쁜 놈들 잡는 데 국경 없다! 통쾌하고 화끈한 범죄 소탕 작전이 다시 펼쳐진다!',
    1, 106, 1
    );
    
INSERT INTO MOVIE VALUES(7, '탑건-매버릭', '조셉 코신스키', '톰 크루즈, 마일즈 텔러, 제니퍼 코넬리',
    '액션', '2022/06/22', 12,
    '"한순간의 실수도 용납되지 않는 하늘 위, 가장 압도적인 비행이 시작된다! 최고의 파일럿이자 전설적인 인물 매버릭(톰 크루즈)은 자신이 졸업한 훈련학교 교관으로 발탁된다. 그의 명성을 모르던 팀원들은 매버릭의 지시를 무시하지만 실전을 방불케 하는 상공 훈련에서 눈으로 봐도 믿기 힘든 전설적인 조종 실력에 모두가 압도된다. 매버릭의 지휘아래 견고한 팀워크를 쌓아가던 팀원들에게 국경을 뛰어넘는 위험한 임무가 주어지자 매버릭은 자신이 가르친 동료들과 함께 마지막이 될 지 모를 하늘 위 비행에 나서는데… "',
    2, 130, 1
    );
INSERT INTO MOVIE VALUES(8, '컴온컴온', '마이크 밀스', '호아킨 피닉스, 우디 노먼, 가비 호프만',
    '드라마', '2022/06/30', 12,
    '"“와서 들어줘, 나의 슬픔! 와서 들려줘, 너의 기쁨!” 어린이의 삶과 미래에 대해 인터뷰하는 라디오 저널리스트 조니. 어머니의 죽음 이후 오랜 시간 등돌리고 살던 여동생 비브의 부탁으로 육아 난이도 극상에 어디로 튈지 모르는 9살 조카 제시를 돌보게 된다. 뜻하지 않게 즐거운 시간과 슬픔의 시간, 조용한 밤과 흥미로운 낮 시간을 함께하게 된 둘. 조니는 제시에게도 인터뷰를 시도하지만 도리어 질문 세례를 받고 마음 깊은 곳에 숨겨둔 과거를 꺼내게 되는데... 이 변화무쌍한 세상 속에 어쩐지 우리, 진짜 가족이 된 것만 같다!"',
    2, 109, 1
    );

INSERT INTO MOVIE VALUES (9, '헤어질 결심', '박찬욱', '탕웨이, 박해일, 이정현, 고경표',
    '로맨스, 멜로, 드라마', '2022/06/29', 15,
    '"산 정상에서 추락한 한 남자의 변사 사건. 담당 형사 "해준"(박해일)은 사망자의 아내 "서래"(탕웨이)와 마주하게 된다. 진심을 숨기는 용의자. 용의자에게 의심과 관심을 동시에 느끼는 형사. 그들의 <헤어질 결심>"',
    1, 138, 1
    );
    
INSERT INTO MOVIE VALUES(10, '미친능력', '톰 고미칸', '니콜라스 케이지, 페드로 파스칼, 닐 패트릭 해리스, 티파니 해디쉬',
    '범죄, 액션, 코미디', '2022/06/29', 15,
    '왕년에 잘나가던 슈퍼스타에서 누구에게도 인정받지 못하는 빚쟁이 신세가 된 ‘닉 케이지’ 그런 그에게 생일 파티 참석을 조건으로 기꺼이 백만 달러를 주겠다는 슈퍼팬 ‘하비’(페드로 파스칼)가 등장한다. 스타로서의 자존심과 어마어마한 제안 사이에서 갈등하던 ‘닉 케이지’는 결국 생일 파티가 열리는 곳으로 향한다. 도착과 동시에 초호화 환대를 받고 행복한 휴양을 보내던 그는 의문의 CIA로부터 납치되고, ‘하비’가 악명 높은 수배범인 사실을 듣게 된다. CIA로부터 가족을 빌미로 위험한 미션을 강요 받은 ‘닉 케이지’는 설상가상 예기치 못한 사건들에 휘말리게 되는데… 감당 불가! 방심 금물! 참을 수 없는 초대형 코믹 액션이 온다! 레디 액션!',
    2, 107, 1
    );
    
INSERT INTO MOVIE VALUES (11, '토르: 러브 앤 썬더', '타이카 와이티티', '크리스 헴스워스, 나탈리 포트만, 크리스찬 베일',
    '액션, 모험, 판타지', '2022/07/06', 12,
    '슈퍼 히어로 시절이여, 안녕! 이너피스를 위해 자아 찾기 여정을 떠난 천둥의 신 ‘토르’ 그러나, 우주의 모든 신들을 몰살하려는 신 도살자 ‘고르’의 등장으로 ‘토르’의 안식년 계획은 산산조각 나버린다. ‘토르’는 새로운 위협에 맞서기 위해, ‘킹 발키리’, ‘코르그’, 그리고 전 여자친구 ‘제인’과 재회하게 되는데, 그녀가 묠니르를 휘두르는 ‘마이티 토르’가 되어 나타나 모두를 놀라게 한다. 이제, 팀 토르는 ‘고르’의 복수에 얽힌 미스터리를 밝히고 더 큰 전쟁을 막기 위한 전 우주적 스케일의 모험을 시작하는데... 우주 최고의 ‘갓’ 매치가 시작된다!',
    2, 118, 1
    );
    
INSERT INTO MOVIE VALUES(12, '비상선언', '한재림', '송강호, 이병헌, 전도연, 김남길, 임시완',
    '드라마', '2022/08/03', 12,
    '사상 초유의 항공테러로 무조건적 착륙을 선포한 비행기를 두고 벌어지는 리얼리티 항공재난 영화',
    1, 141, 2
    );

INSERT INTO MOVIE VALUES(13, '킹스맨: 퍼스트 에이전트', '매튜 본', '랄프 파인즈, 해리스 딕킨슨. 리스 이판, 젬마 아터튼',
    '액션', '2021/12/22', 19,
    '역사상 최악의 폭군들과 범죄자들이 모여 수백만 명의 생명을 위협할 전쟁을 모의하는 광기의 시대. 이들을 막으려는 한 사람과 그가 비밀리에 운영 중인 독립 정보기관, ‘킹스맨’의 최초 미션이 시작된다! 베일에 감춰졌던 킹스맨의 탄생을 목격하라!',
    2, 130, 0
    );

INSERT INTO MOVIE VALUES(14, '엔칸토: 마법의 세계', '바이론 하워드, 자레드 부시', '스테파니 비트리즈, 윌머 발더라마, 다이앤 게레로, 앤지 세페다',
    '애니메이션', '2021/11/24', 1,
    '콜롬비아의 깊은 산 속, 놀라운 마법과 활기찬 매력이 넘치는 세계 ‘엔칸토’. 그 곳에는 특별한 능력을 지닌 마드리갈 패밀리가 살고 있다. ‘엔칸토’의 마법 덕분에 초인적 힘, 치유하는 힘 등 저마다 특별한 능력을 가지고 태어난 마드리갈 패밀리. 하지만 ‘미라벨’은 가족 중 유일하게 아무런 능력이 없다. 어느 날, ‘엔칸토’를 둘러싼 마법의 힘이 위험에 처하자 ‘미라벨’은 유일하게 평범한 자신이 특별한 이 가족의 마지막 희망일지 모른다고 생각하는데.. 평범한 ‘미라벨’은 과연 기적을 만들 수 있을까? 전 세대 관객들에게 따뜻한 웃음과 감동을 선사할 마법 같은 영화! 디즈니의 매직이 또 한 번 시작된다',
    2, 109, 0
    );
    
INSERT INTO MOVIE VALUES(15, '크루엘라', '크레이그 질레스피', '엠마 스톤, 엠마 톰슨, 마크 스트롱, 폴 월터 하우저, 에밀리 비샴',
    '드라마, 범죄, 코미디', '2021/05/26', 12,
    '처음부터 난 알았어. 내가 특별하단 걸 그게 불편한 인간들도 있겠지만 모두의 비위를 맞출 수는 없잖아? 그러다 보니 결국, 학교를 계속 다닐 수가 없었지 우여곡절 런던에 오게 된 나, 에스텔라는 재스퍼와 호레이스를 운명처럼 만났고 나의 뛰어난 패션 감각을 이용해 완벽한 변장과 빠른 손놀림으로 런던 거리를 싹쓸이 했어 도둑질이 지겹게 느껴질 때쯤, 꿈에 그리던 리버티 백화점에 낙하산(?)으로 들어가게 됐어 거리를 떠돌았지만 패션을 향한 나의 열정만큼은 언제나 진심이었거든 근데 이게 뭐야, 옷에는 손도 못 대보고 하루 종일 바닥 청소라니 인내심에 한계를 느끼고 있을 때, 런던 패션계를 꽉 쥐고 있는 남작 부인이 나타났어 천재는 천재를 알아보는 법! 난 남작 부인의 브랜드 디자이너로 들어가게 되었지 꿈을 이룰 것 같았던 순간도 잠시, 세상에 남작 부인이 ‘그런 사람’이었을 줄이야… 그래서 난 내가 누군지 보여주기로 했어 잘가, 에스텔라 난 이제 크루엘라야!',
    2, 133, 0
    );

INSERT INTO MOVIE VALUES (16, '버즈 라이트이어', '앤거슨 맥클레인', '크리스 에반스, 타이카 와이티티, 피터손',
    '애니메이션', '2022/06/15', 1,
    '미션 #1 나, 버즈 라이트이어. 인류 구원에 필요한 자원을 감지하고 현재 수많은 과학자들과 미지의 행성으로 향하고 있다. 이번 미션은 인류의 역사를 새롭게 쓸 것이라 확신한다. 미션 #2 잘못된 신호였다. 이곳은 삭막하고 거대한 외계 생물만이 살고 있는 폐허의 땅이다. 나의 실수로 모두가 이곳에 고립되고 말았다. 모두를 구하기 위해서 모든 것을 제자리에 돌려 놔야 한다. 미션 #3 실수를 바로잡기 위한 탈출 미션을 위해 1년의 준비를 마쳤다. 어쩌다 한 팀이 된 정예 부대와 이 미션을 수행할 예정이다. 우주를 집어삼킬 ‘저그’와 대규모 로봇 군사의 위협이 계속되지만 나는 절대 포기할 수 없다. 그런데… 여긴 또 어디지? 시간 속에 갇힌 건가?',
    2, 105, 1
    );
    

INSERT INTO MOVIE VALUES (17, '쥬라기 월드 - 도미니언', '콜린 트레보로우', '크리스 프랫, 브라이스 달라스 하워드, 드완다 와이즈',
    '액션, 어드벤쳐', '2022/06/01', 12,
    '공룡들의 터전이었던 이슬라 누블라 섬이 파괴된 후, 마침내 공룡들은 섬을 벗어나 세상 밖으로 출몰한다. 지상에 함께 존재해선 안 될 위협적 생명체인 공룡의 등장으로 인류 역사상 겪어보지 못한 사상 최악의 위기를 맞이한 인간들. 지구의 최상위 포식자 자리를 걸고 인간과 공룡의 최후의 사투가 펼쳐진다.',
    2, 147, 1
    );
    
INSERT INTO MOVIE VALUES (18, '닥터 스트레인지 - 대혼돈의 멀티버스', '샘 레이미', '베네딕트 컴버배치, 엘리자베스 올슨, 베네딕트 웡',
    '액션, 어드벤쳐, 판타지', '2022/05/04', 12,
    '끝없이 균열되는 차원과 뒤엉킨 시공간의 멀티버스가 열리며 오랜 동료들, 그리고 차원을 넘어 들어온 새로운 존재들을 맞닥뜨리게 된 ‘닥터 스트레인지’. 대혼돈 속, 그는 예상치 못한 극한의 적과 맞서 싸워야만 하는데….',
    2, 126, 1
    );
    
INSERT INTO MOVIE VALUES(19, '메모리', '마틴 캠벨', '리암 니슨, 가이 피어스, 모니카 벨루치, 레이 스티븐슨',
    '범죄, 액션', '2022/07/13', 15,
    '기억을 잃어가는 킬러(리암 니슨)가 자신의 신념에 부딪히는 의뢰를 거절하고, 극악한 범죄 조직의 타깃이 되면서 새로운 사건을 쫓는 동시에 처절한 응징을 예고하는 범죄 액션',
    2, 114, 2
    );

INSERT INTO MOVIE VALUES(20, '뒤틀린 집', '강동헌', '서영희, 김보민, 김민재',
    '호러, 드라마, 스릴러', '2022/07/13', 15,
    '“이 집에 틈이 있다는 거.. 아세요?” 피치 못할 사정으로 외딴집에 이사 오게 된 가족. 엄마 ‘명혜’는 이사 온 첫 날부터 이 집이 뒤틀렸다고 전하는 이웃집 여자의 경고와 창고에서 들리는 불길한 소리로 인해 밤잠을 설친다. 아빠 ‘현민’은 그런 ‘명혜’를 신경쇠약으로만 여기고, 둘째 딸 ‘희우’는 가족들이 보지 못하는 무언가를 마주하지만 그 사실을 숨긴다. 그러던 어느 날, 알 수 없는 기운에 이끌려 잠겨 있던 창고문을 열고 만 명혜는 무언가에 사로잡힌 듯 다른 사람처럼 행동하기 시작하는데… 뒤틀린 틈에서 시작된 비극이 가족을 집어삼키려 한다!',
    1, 91, 2
    );
    
INSERT INTO MOVIE VALUES(21, '더 킬러-죽어도 되는 아이', '최재훈', '장혁, 브루스 칸, 이서영',
    '액션', '2022/07/13', 12,
    '평화를 위해 다시 시작된 킬러 본능! 은퇴 후 성공적인 재테크로 호화롭게 생활하는 전설의 킬러 ‘의강’이 제멋대로 행동하는 여고생 ‘윤지’를 떠맡게 된다. 단기간 보호자 역할만 하면 될 거라고 가볍게 여긴 순간 ‘윤지’가 납치되는 사건이 일어나는데… “걔는 다치면 안 되는 아이야” 애써 잠재운 ‘의강’의 본능이 깨어난다!',
    1, 94, 2
    );
    
INSERT INTO MOVIE VALUES(22, '해적-도깨비 깃발', '김정훈', '강하늘, 한효주, 이광수, 권상우, 채수빈',
    '어드벤쳐, 액션, 코미디', '2022/01/26', 12,
    '“가자, 보물 찾으러!” 자칭 고려 제일검인 의적단 두목 ‘무치’(강하늘)와 바다를 평정한 해적선의 주인 ‘해랑’(한효주). 한 배에서 운명을 함께하게 된 이들이지만 산과 바다, 태생부터 상극으로 사사건건 부딪히며 바람 잘 날 없는 항해를 이어간다. 그러던 어느 날, 왜구선을 소탕하던 이들은 흔적도 없이 사라진 왕실의 보물이 어딘가 숨겨져 있다는 사실을 알게 되고 해적 인생에 다시없을 최대 규모의 보물을 찾아 위험천만한 모험에 나서기 시작한다. 하지만 사라진 보물을 노리는 건 이들뿐만이 아니었으니! 원하는 것을 얻기 위해 수단과 방법을 가리지 않는 역적 ‘부흥수’(권상우) 또한 보물을 차지하기 위해 바다에 뛰어드는데...! 해적과 의적, 그리고 역적 사라진 보물! 찾는 자가 주인이다!',
    1, 125, 1
    );

INSERT INTO MOVIE VALUES(23, '모가디슈', '류승완', '김윤석, 조인성, 허준호, 구교환, 김소진',
    '액션, 드라마', '2021/07/28', 15,
    '내전으로 고립된 낯선 도시, 모가디슈 지금부터 우리의 목표는 오로지 생존이다! 대한민국이 UN가입을 위해 동분서주하던 시기 1991년 소말리아의 수도 모가디슈에서는 일촉즉발의 내전이 일어난다. 통신마저 끊긴 그 곳에 고립된 대한민국 대사관의 직원과 가족들은 총알과 포탄이 빗발치는 가운데, 살아남기 위해 하루하루를 버텨낸다. 그러던 어느 날 밤, 북한 대사관의 일행들이 도움을 요청하며 문을 두드리는데… 목표는 하나, 모가디슈에서 탈출해야 한다!',
    1, 121, 0
    );
    
INSERT INTO MOVIE VALUES(24, '이터널스', '클로이 자오', '안젤리나 졸리, 마동석, 리차드 매든, 쿠마일 난지아니',
    '액션, 어드벤쳐, 드라마', '2021/11/03', 12,
    '수 천년에 걸쳐 그 모습을 드러내지 않고 살아온 불멸의 히어로들이 <어벤져스: 엔드게임> 이후 인류의 가장 오래된 적 "데비안츠"에 맞서기 위해 다시 힘을 합치면서 벌어지는 이야기',
    2, 156, 0
    );

INSERT INTO MOVIE VALUES(25, '분노의 질주 - 더 얼티메이트', '저스틴 린', '빈 디젤, 존 시나, 성 강, 샤를리즈 테론',
    '액션', '2021/05/19', 12,
    '기다림은 끝났다! 전 세계가 기다려온 단 하나의 액션블록버스터! 도미닉(빈 디젤)은 자신과 가장 가까웠던 형제 제이콥(존 시나)이 사이퍼(샤를리즈 테론)와 연합해 전 세계를 위기로 빠트릴 위험천만한 계획을 세운다는 사실을 알게 되고, 이를 막기 위해 다시 한 번 패밀리들을 소환한다. 가장 가까운 자가 한순간, 가장 위험한 적이 된 상황 도미닉과 패밀리들은 이에 반격할 놀라운 컴백과 작전을 세우고 지상도, 상공도, 국경도 경계가 없는 불가능한 대결이 시작되는데…',
    2, 143, 0
    );
    
INSERT INTO MOVIE VALUES(26, '블랙 위도우', '케이트 쇼트랜드', '스칼렛 요한슨, 플로렌스 퓨, 레이첼 와이즈',
    '액션, 어드벤쳐, SF', '2021/07/07', 12,
    '"모든 것을 바꾼 그녀의 선택” 어벤져스의 운명을 바꾼 블랙 위도우, 그녀의 진짜 이야기가 시작된다! 어벤져스의 히어로 블랙 위도우, ‘나타샤 로마노프’ (스칼렛 요한슨)는 자신의 과거와 연결된 레드룸의 거대한 음모와 실체를 깨닫게 된다. 상대의 능력을 복제하는 빌런 ‘태스크마스터’와 새로운 위도우들의 위협에 맞서 목숨을 건 반격을 시작하는 ‘나타샤’는 스파이로 활약했던 자신의 과거 뿐 아니라, 어벤져스가 되기 전 함께했던 동료들을 마주해야만 하는데…',
    2, 134, 0
    );
    
INSERT INTO MOVIE VALUES(27, '극장판 귀멸의 칼날-무한열차편', '소토자키 하루오', '이경태, 김연우, 김지율, 이호산',
    '애니메이션', '2022/04/21', 15,
    '혈귀로 변한 여동생 ‘네즈코’를 되돌리기 위해 귀살대가 된 ‘탄지로’! 어둠속을 달리는 무한열차에서 승객들이 흔적 없이 사라진다는 소식에 ‘젠이츠’, ‘이노스케’와 함께 임무 수행을 위해 무한열차에 탑승한다. 그리고 그 곳에서 만난 귀살대 최강 검사 염주 ‘렌고쿠’! 이들은 무한열차에 숨어 있는 혈귀의 존재를 직감하고 모두를 구하기 위해 목숨을 건 혈전을 시작하는데…그 칼로 악몽을 끊어라!',
    2, 117, 0
    );
    
INSERT INTO MOVIE VALUES(28, '신비한 동물들과 덤블도어의 비밀', '데이빗 예이츠', '에디 레드메인, 주드 로, 매즈 미켈슨',
    '어드벤쳐, 가족, 판타지', '2022/04/13', 12,
    '가장 위험한 마법에 맞선, 세상을 구할 전쟁이 시작된다! 1930년대, 제2차 세계대전에 마법사들이 개입하게 되면서 강력한 어둠의 마법사 그린델왈드의 힘이 급속도로 커진다. 덤블도어는 뉴트 스캐맨더에게 위대한 마법사 가문 후손, 마법학교의 유능한 교사, 머글 등으로 이루어진 팀에게 임무를 맡긴다. 이에 뉴트와 친구들은 머글과의 전쟁을 선포한 그린델왈드와 추종자들, 그의 위험한 신비한 동물들에 맞서 세상을 구할 거대한 전쟁에 나선다. 한편 전쟁의 위기가 최고조로 달한 상황 속에서 덤블도어는 더이상 방관자로 머물 수 없는 순간을 맞이하고, 서서히 숨겨진 비밀이 드러나는데',
    2, 142, 0
    );

INSERT INTO MOVIE VALUES(29, '인질', '필감성', '황정민, 김재범, 이유미, 류경수',
    '액션, 스릴러', '2021/08/18', 15,
    '배우 황정민 "인질"로 잡혔다! 평소와 똑같던 어느 새벽, 서울 한복판에서 증거도, 목격자도 없이 대한민국 톱배우 "황정민"이 납치된다. 한 치 앞을 알 수 없는 상황 속 살기 위한 극한의 탈주가 시작되는데… 올여름, 관객들을 사로잡을 리얼리티 액션스릴러가 온다!',
    1, 94, 0
    );
    
INSERT INTO MOVIE VALUES(30, '007 노 타임 투 다이', '캐리 후쿠나가', '다니엘 그레이그, 라미 말렉, 라샤나 린치',
    '액션', '2021/09/29', 12,
    '가장 강력한 운명의 적과 마주하게된 제임스 본드의 마지막 미션이 시작된다.',
    2, 163, 0
    );

COMMIT;